NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_wificore.svd
        <register>
          <name>HCFG</name>
          <description>Host Configuration Register</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSLSPCLKSEL</name>
              <description>FS/LS PHY Clock Select (FSLSPclkSel)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK3060</name>
                  <description>PHY clock is running at 30/60 MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK48</name>
                  <description>PHY clock is running at 48 MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK6</name>
                  <description>PHY clock is running at 6 MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSLSSUPP</name>
              <description>FS- and LS-Only Support (FSLSSupp)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSFSLS</name>
                  <description>HS/FS/LS, based on the maximum speed supported by the connected device</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSLS</name>
                  <description>FS/LS-only, even if the connected device can support HS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENA32KHZS</name>
              <description>Enable 32 KHz Suspend mode (Ena32KHzS)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>32 KHz Suspend mode disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>32 KHz Suspend mode enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESVALID</name>
              <description>Resume Validation Period  (ResValid)</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>DISTXIPGAPDLYCHECK</name>
              <description>Disable Linestate check for Token to Token/Data interpacket gap delay calculation (dis_tx_ipgap_dly_check)</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Enable Linestate check</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Disable Linestate check</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DESCDMA</name>
              <description>Enable Scatter/gather DMA in Host mode (DescDMA)</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Scatter/Gather DMA in Host mode is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Scatter/Gather DMA selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRLISTEN</name>
              <description>Frame List Entries(FrListEn)</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENTRY8</name>
                  <description>8 Entries</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENTRY16</name>
                  <description>16 Entries</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENTRY32</name>
                  <description>32 Entries</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENTRY63</name>
                  <description>64 Entries</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERSCHEDENA</name>
              <description>Enable Periodic Scheduling (PerSchedEna):</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables periodic scheduling within the core</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enables periodic scheduling within the core</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODECHTIMEN</name>
              <description>Mode Change Ready Timer Enable (ModeChTimEn)</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The Host core waits for either 200 PHY clock cycles or a linestate of SE0 at the end of resume to change the opmode from 0x2 to 0x0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The Host core waits only for a linestate of SE0 at the end of resume to change the opmode from 0x2 to 0x0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFIR</name>
          <description>Host Frame Interval Register</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000EA60</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRINT</name>
              <description>Frame Interval (FrInt)</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>HFIRRLDCTRL</name>
              <description>Reload Control (HFIRRldCtrl)</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>The HFIR cannot be reloaded dynamically</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>The HFIR can be dynamically reloaded during runtime</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFNUM</name>
          <description>Host Frame Number/Frame Time Remaining Register</description>
          <addressOffset>0x408</addressOffset>
          <access>read-write</access>
          <resetValue>0x00003FFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRNUM</name>
              <description>Frame Number (FrNum)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No SOF is transmitted</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>SOF is transmitted</description>
                  <value>0x0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRREM</name>
              <description>Frame Time Remaining (FrRem)</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTXSTS</name>
          <description>Host Periodic Transmit FIFO/Queue Status Register</description>
          <addressOffset>0x410</addressOffset>
          <access>read-write</access>
          <resetValue>0x00080C00</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PTXFSPCAVAIL</name>
              <description>Periodic Transmit Data FIFO Space Available (PTxFSpcAvail)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXQSPCAVAIL</name>
              <description>Periodic Transmit Request Queue Space Available (PTxQSpcAvail)</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Periodic Transmit Request Queue is full</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE1</name>
                  <description>1 location available</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE2</name>
                  <description>2 locations available</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE3</name>
                  <description>3 locations available</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE4</name>
                  <description>4 locations available</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE5</name>
                  <description>5 locations available</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE6</name>
                  <description>6 locations available</description>
                  <value>0x06</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE7</name>
                  <description>7 locations available</description>
                  <value>0x07</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE8</name>
                  <description>8 locations available</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE9</name>
                  <description>9 locations available</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE10</name>
                  <description>10 locations available</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE11</name>
                  <description>11 locations available</description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE12</name>
                  <description>12 locations available</description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE13</name>
                  <description>13 locations available</description>
                  <value>0x0D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE14</name>
                  <description>14 locations available</description>
                  <value>0x0E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREE15</name>
                  <description>15 locations available</description>
                  <value>0x0F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTXQTOP</name>
              <description>Top of the Periodic Transmit Request Queue (PTxQTop)</description>
              <lsb>23</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINT</name>
          <description>Host All Channels Interrupt Register</description>
          <addressOffset>0x414</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HAINT</name>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Not active</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Host Channel Interrupt</description>
                  <value>0x0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINTMSK</name>
          <description>Host All Channels Interrupt Mask Register</description>
          <addressOffset>0x418</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HAINTMSK</name>
              <description>Channel Interrupt Mask (HAINTMsk)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask Channel interrupt</description>
                  <value>0x0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNMASK</name>
                  <description>UnMask Channel interrupt</description>
                  <value>0x0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFLBADDR</name>
          <description>Host Frame List Base Address Register</description>
          <addressOffset>0x41C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HFLBADDR</name>
              <description>The starting address of the Frame list.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
