NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120/nrf7120_wificore.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_MSPI00</name>
      <description>Multi serial peripheral interface 0</description>
      <baseAddress>0x5005B000</baseAddress>
      <headerStructName>MSPI</headerStructName>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MSPI00</name>
        <value>91</value>
      </interrupt>
      <groupName>MSPI</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start operation.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start operation.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RESET</name>
          <description>Reset the MSPI</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_RESET</name>
              <description>Reset the MSPI</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ACQUIRESEMAPHORE</name>
          <description>Request the semaphore This task is exclusive to the 'peripheral' configuration</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_ACQUIRESEMAPHORE</name>
              <description>Request the semaphore This task is exclusive to the 'peripheral' configuration</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RELEASESEMAPHORE</name>
          <description>Release the semaphore This task is exclusive to the 'peripheral' configuration</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_RELEASESEMAPHORE</name>
              <description>Release the semaphore This task is exclusive to the 'peripheral' configuration</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CORE</name>
          <description>Interrupt from the MSPI core</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_CORE</name>
              <description>Interrupt from the MSPI core</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>EVENTS_DMA</name>
          <description>Peripheral events.</description>
          <headerStructName>MSPI_EVENTS_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x104</addressOffset>
          <cluster>
            <name>EVENTS_DONE</name>
            <description>Peripheral events.</description>
            <headerStructName>MSPI_EVENTS_DMA_EVENTS_DONE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>LIST</name>
              <description>Descriptor list is complete.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LIST</name>
                  <description>Descriptor list is complete.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotGenerated</name>
                      <description>Event not generated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Generated</name>
                      <description>Event generated</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>LISTPART</name>
              <description>Descriptor list is partially complete. Threshold in CONFIG.LISTPARTTHRESH register has been passed.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>LISTPART</name>
                  <description>Descriptor list is partially complete. Threshold in CONFIG.LISTPARTTHRESH register has been passed.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotGenerated</name>
                      <description>Event not generated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Generated</name>
                      <description>Event generated</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SELECTJOB</name>
              <description>Selected job is completed. Selection is done via CONFIG.SELECTJOBENABLE.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SELECTJOB</name>
                  <description>Selected job is completed. Selection is done via CONFIG.SELECTJOBENABLE.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotGenerated</name>
                      <description>Event not generated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Generated</name>
                      <description>Event generated</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>DATA</name>
              <description>A job has been completed, i.e. the job's data has been completely transferred either to AXI or DMA bus, depending on direction.</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DATA</name>
                  <description>A job has been completed, i.e. the job's data has been completely transferred either to AXI or DMA bus, depending on direction.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotGenerated</name>
                      <description>Event not generated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Generated</name>
                      <description>Event generated</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>JOB</name>
              <description>A job has been fetched from the joblist.</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>JOB</name>
                  <description>A job has been fetched from the joblist.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotGenerated</name>
                      <description>Event not generated</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Generated</name>
                      <description>Event generated</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>ERROR</name>
            <description>AXI bus error received.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERROR</name>
                <description>AXI bus error received.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PAUSED</name>
            <description>DMA paused with task TASKS_PAUSE.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PAUSED</name>
                <description>DMA paused with task TASKS_PAUSE.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RESET</name>
            <description>DMA reset with task TASKS_RESET.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RESET</name>
                <description>DMA reset with task TASKS_RESET.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DONE</name>
            <description>DMA transfer done</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DONE</name>
                <description>DMA transfer done</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXUNEXPECTEDIDLE</name>
            <description>The MSPI core has gone into idle state at an unexpected time, this can happen if the TX buffer underflows, this event is followed by either DONE or ABORTED event.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TXUNEXPECTEDIDLE</name>
                <description>The MSPI core has gone into idle state at an unexpected time, this can happen if the TX buffer underflows, this event is followed by either DONE or ABORTED event.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>INTERNALBUSERROR</name>
            <description>An error occurred during the transfer of data internally in the MSPI, followed by either DONE or ABORTED event.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>INTERNALBUSERROR</name>
                <description>An error occurred during the transfer of data internally in the MSPI, followed by either DONE or ABORTED event.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ABORTED</name>
            <description>The MSPI DMA has aborted due to an error given in a separate event, and has attempted to complete any ongoing transactions, and stopped.
        The MSPI DMA is ready for a new transaction.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ABORTED</name>
                <description>The MSPI DMA has aborted due to an error given in a separate event, and has attempted to complete any ongoing transactions, and stopped.
        The MSPI DMA is ready for a new transaction.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotGenerated</name>
                    <description>Event not generated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Generated</name>
                    <description>Event generated</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>EVENTS_IDLE</name>
          <description>This event signifies that the MSPI core is no longer busy</description>
          <addressOffset>0x134</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_IDLE</name>
              <description>This event signifies that the MSPI core is no longer busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_OVERFLOW</name>
          <description>The MSPI peripheral has received the specified number of bytes. Any data received after this event will be discarded if a new RX buffer has not been configured. This event is exclusive to the 'peripheral' configuration</description>
          <addressOffset>0x138</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_OVERFLOW</name>
              <description>The MSPI peripheral has received the specified number of bytes. Any data received after this event will be discarded if a new RX buffer has not been configured. This event is exclusive to the 'peripheral' configuration</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ACQUIRED</name>
          <description>The semaphore has been acquired by the CPU This event is exclusive to the 'peripheral' configuration</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_ACQUIRED</name>
              <description>The semaphore has been acquired by the CPU This event is exclusive to the 'peripheral' configuration</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
